<?php
// +----------------------------------------------------------------------
// | 应用设置
// +----------------------------------------------------------------------

return [
    // 应用地址
    'app_host' => env('app.host', ''),
    // 应用的命名空间
    'app_namespace' => '',
    // 是否启用路由
    'with_route' => true,
    // 是否启用事件
    'with_event' => true,
    // 默认应用
    'default_app' => 'index',
    // 默认时区
    'default_timezone' => 'Asia/Shanghai',

    // 应用映射（自动多应用模式有效）
    'app_map' => ['index'],
    // 域名绑定（自动多应用模式有效）
    'domain_bind' => [],
    // 禁止URL访问的应用列表（自动多应用模式有效）
    'deny_app_list' => [],

    // 异常页面的模板文件
    'exception_tmpl' => app()->getThinkPath() . 'tpl/think_exception.tpl',

    // 错误显示信息,非调试模式有效
    'error_message' => '页面错误！请稍后再试～',
    // 显示错误信息
    'show_error_msg' => true,

    'system' => [
        'jwt_secret_key' => '58&%97@*^54*89@***###',
        'pass_salt' => '58&%97@*^54*89',
        'jwt_algorithm' => 'HS256'
    ],

    'error' => [
        //错误码定义
        /************10001-10099  系统相关错误；10101-10199，接口相关；10201-10299，支付相关；10301-10399 ，用户相关；10801-10899 第三方相关 ；10901-10999 保留给第三方定义 ；101001+具体业务相关。***********/
        //10001-10099  系统相关错误
        10000 => '无错误',
        10001 => '一般错误',
        10002 => '系统错误',
        10003 => '配置缺少',
        10004 => '文件上传错误',

        //10101-10199，接口相关
        10101 => '签名参数缺失',
        10102 => '接口签名验证失败',
        10103 => 'appid不存在',
        10104 => 'appId已被禁用',

        //10301-10399 ，用户相关
        10301 => '用户已被禁用',
        10302 => '用户不存在',

        10303 => '用户密码错误',
        10304 => '用户组已被禁用',
        10305 => '用户在其它设备登录',
        10306 => '用户访问令牌缺失',
        10307 => '用户访问令牌过期',
        10308 => '用户登录方式错误',
        10309 => '用户已存在',
        10310 => '店铺正在申请中',
    ]
];
